# HasSpatialElementFromToCalculationPoints Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
FamilyInstance..::..HasSpatialElementFromToCalculationPoints Property
FamilyInstance Class See Also
---
Identifies if this instance has a pair of SpatialElementCalculationPoints used as the search points for Revit to identify if the instance lies between up to two rooms or spaces.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2016
# Syntax
C#
---
```text
public bool HasSpatialElementFromToCalculationPoints { get; }
```

Visual Basic
---
```text
Public ReadOnly Property HasSpatialElementFromToCalculationPoints As Boolean
	Get
```

Visual C++
---
```text
public:
property bool HasSpatialElementFromToCalculationPoints {
	bool get ();
}
```

# ### Return Value
True if this instance has a pair of SpatialElementCalculationPoints used as the search points, false otherwise.
# Remarks
The points determine which room or space is considered the "from" and which is considered the "to" for a family instance which connects two rooms or spaces, such as a door or window.
# See Also
FamilyInstance Class
Autodesk.Revit.DB Namespace